Update ai_engineering_101.md
